# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
my_list= [-4,-1,1,2,8]
summa=0 
for el in my_list:
    summa=summa+el
    print(summa)
